"""
========================================================================================================================
Задание:
    Разработать лексический анализатор.
    На вход подаются два вида слов в любом порядке, разделенные любым количеством пробелов.
    Текст может быть многострочным.
    Текст может содержать комментарии.
    Шаблон комментария разработать самостоятельно.
    Комментарии и пробелы должны пропускаться.
========================================================================================================================
Пробел используется для разделения типов слов, в остальных случаях он опускается.
========================================================================================================================
"""