"""
========================================================================================================================
Задание:
    Разработать лексический анализатор.
    На вход подаются два вида слов в любом порядке, разделенные любым количеством пробелов.
    Текст может быть многострочным.
    Текст может содержать комментарии.
    Шаблон комментария разработать самостоятельно.
    Комментарии и пробелы должны пропускаться.
Вариант 14:
    первый тип слов: (010)*000(001)*
    второй тип слов: (a|b|c|d)+ (Первые два символа второго типа всегда ca)
========================================================================================================================
Пробел используется для разделения типов слов, в остальных случаях он опускается.
========================================================================================================================
"""
from src.transliterator import transliterate_symbol
from src.tokens import first_token


def analyze(string):
    transliterated = []
    for symbol in string:
        transliterated.append(transliterate_symbol(symbol))
    return first_token.start(transliterated, 0)

